{
  "version": "https://jsonfeed.org/version/1",
  "title": "public void",
  "home_page_url": "https://muratozkan.github.io/",
  "feed_url": "https://muratozkan.github.io/feed/feed.json",
  "description": "Books, Software and Games",
  "author": {
    "name": "Murat Özkan",
    "url": "https://muratozkan.github.io/about-me/"
  },
  "items": [{
      "id": "https://muratozkan.github.io/2020/11/the-moon-is-a-harsh-mistress/",
      "url": "https://muratozkan.github.io/2020/11/the-moon-is-a-harsh-mistress/",
      "title": "The Moon is a Harsh Mistress",
      "content_html": "<p><strong>My score: 4⭐ (out of 5)</strong></p>\n<p>It's 2070s and humanity is finally colonizing the moon - around 40 million people is living in multiple subterranean (sublunaean?) cities, connected with tube systems and all controlled with a huge, central mainframe computer with so much computing power that it becomes conscious. Sadly, ethical progress lags behind the technological progress. The Luna colonies are prison colonies, Earth is dumping convicts of all kinds (regardless of country) there. There are no laws, the Wardens are only interested in the food delivered to Earth via a huge railgun. Earth is suffering from overpopulation and food shortage, and depending on food shipped from Luna. You can guess where it goes from there.</p>\n<p>The premise is really interesting, the book reads like a prequel of the Expanse. The physics work like it does in the real world, including some non-obvious limitations. Colonies are a closed habitat that have to reuse everything - air, water, even the organics in people. Working from there, the author explores the structure, social and political aspects of such a society.</p>\n<p>I had to take 1 star off, mainly because of extreme sexism against women - not just in Luna, but also on Earth. Also, author uses the antagonist's native dialect extensively (an amalgamation of most languages of inmates), making the novel too hard to read. I suggest trying to look past these issues if you intend to read this awesome novel.</p>\n<p><em>This review is also available on <a href=\"https://www.goodreads.com/review/show/2021237727\">Goodreads</a>.</em></p>\n",
      "date_published": "2020-11-24T00:00:00Z"
    },{
      "id": "https://muratozkan.github.io/2020/11/the-big-picture-on-the-origins-of-life-meaning-and-the-universe-itself/",
      "url": "https://muratozkan.github.io/2020/11/the-big-picture-on-the-origins-of-life-meaning-and-the-universe-itself/",
      "title": "The Big Picture: On the Origins of Life, Meaning, and the Universe Itself",
      "content_html": "<p><strong>My score: 5⭐ (out of 5)</strong></p>\n<p>Sean Carroll explains us how well the &quot;Core Theory&quot; describes the world we live in and uses it the push forward the idea of Poetic Naturalism as a way to understand the world around us.</p>\n<p>He defines Core Theory as the physics describing how everyday things work - and he is very comprehensive there. Core Theory considers quantum field theory, gravitation, electromagnetism, some part of nuclear physics (that explain how quarks come together to form protons and neutrons) - among other things as &quot;the reality&quot;. Of course, Core Theory falls short in extreme environments like how quantum stuff near black holes behave, but he argues this is fine since we are not subject to that kind of physics in daily life.</p>\n<p>This could also form the basis of Naturalism in which only the underlying Quantum Fields are the reality and nothing else exist. Sean Carroll extends Naturalism by arguing that the abstractions we form on the foundations (the quantum fields) are also real, as special arrangement of real particles, the stories are a part of reality as well - effectively avoiding the mind/matter duality. Then he sets on to discuss physical, biological, individual and social constructs with the light of Poetic Naturalism.</p>\n<p>Well, to me, the name &quot;Poetic Naturalism&quot; is too to poetic for my taste. Of course the idea itself makes a lot of sense and what's better, it works! Combined with Sean Carroll's excellent writing style, it was a very nice book that I'd like to read again!</p>\n<p><em>This review is also available on <a href=\"https://www.goodreads.com/review/show/3623396258\">Goodreads</a>.</em></p>\n",
      "date_published": "2020-11-03T00:00:00Z"
    }
  ]
}
